<a href="https://colab.research.google.com/github/ralsouza/organizing_and_visualizing_data_python/blob/master/notebooks/19_python_pandas_join_tables.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

# Data Creation

In [28]:
# data1
data1 = pd.DataFrame({
    'discipline_id': ['1','2','3','4','5'],
    'name': ['Bernardo','Alan','Mateus','Ivo','Gerson'],
    'last_name': ['Anderson','Teixeira','Amoedo','Trindade','Vargas']})

data1

  discipline_id      name last_name
0             1  Bernardo  Anderson
1             2      Alan  Teixeira
2             3    Mateus    Amoedo
3             4       Ivo  Trindade
4             5    Gerson    Vargas

In [29]:
# data2
data2 = pd.DataFrame({
    'discipline_id': ['1','2','3','4','5'],
    'name': ['Roberto','Mariana','Ana','Marcos','Maria'],
    'last_name': ['Sampaio','Fernandes','Arantes','Menezes','Martins']})

data2

  discipline_id     name  last_name
0             1  Roberto    Sampaio
1             2  Mariana  Fernandes
2             3      Ana    Arantes
3             4   Marcos    Menezes
4             5    Maria    Martins

In [30]:
# data3
data3 = pd.DataFrame({
    'discipline_id':['1','2','3','4','5','6','7','8','9','10','11'],
    'test_id': [81,75,75,71,76,84,95,61,57,90,85]})

data3

   discipline_id  test_id
0              1       81
1              2       75
2              3       75
3              4       71
4              5       76
5              6       84
6              7       95
7              8       61
8              9       57
9             10       90
10            11       85

# Concating dataframes by rows

In [31]:
# It was necessary to reprocess the index
data_new = pd.concat([data1,data2]).reset_index(drop=True); data_new

  discipline_id      name  last_name
0             1  Bernardo   Anderson
1             2      Alan   Teixeira
2             3    Mateus     Amoedo
3             4       Ivo   Trindade
4             5    Gerson     Vargas
5             1   Roberto    Sampaio
6             2   Mariana  Fernandes
7             3       Ana    Arantes
8             4    Marcos    Menezes
9             5     Maria    Martins

# Concating dataframes by columns

In [0]:
# 1. The join was by axis 1, that is, horizontally or by column
# 2. Note the duplicated columns discipline_id, because de join. 
#    It can be resolved using pd.DataFrame.merge()
pd.concat([data1,data2],axis=1)

  discipline_id      name last_name discipline_id     name  last_name
0             1  Bernardo  Anderson             1  Roberto    Sampaio
1             2      Alan  Teixeira             2  Mariana  Fernandes
2             3    Mateus    Amoedo             3      Ana    Arantes
3             4       Ivo  Trindade             4   Marcos    Menezes
4             5    Gerson    Vargas             5    Maria    Martins

# Joining dataframes by one id column

In [32]:
pd.merge(data_new,data3,on='discipline_id')

  discipline_id      name  last_name  test_id
0             1  Bernardo   Anderson       81
1             1   Roberto    Sampaio       81
2             2      Alan   Teixeira       75
3             2   Mariana  Fernandes       75
4             3    Mateus     Amoedo       75
5             3       Ana    Arantes       75
6             4       Ivo   Trindade       71
7             4    Marcos    Menezes       71
8             5    Gerson     Vargas       76
9             5     Maria    Martins       76

# Outer Join

In [33]:
pd.merge(data1,data2,on='discipline_id',how='outer')

  discipline_id    name_x last_name_x   name_y last_name_y
0             1  Bernardo    Anderson  Roberto     Sampaio
1             2      Alan    Teixeira  Mariana   Fernandes
2             3    Mateus      Amoedo      Ana     Arantes
3             4       Ivo    Trindade   Marcos     Menezes
4             5    Gerson      Vargas    Maria     Martins

# Inner Join

In [36]:
pd.merge(data1,data2,on='discipline_id',how='inner')

  discipline_id    name_x last_name_x   name_y last_name_y
0             1  Bernardo    Anderson  Roberto     Sampaio
1             2      Alan    Teixeira  Mariana   Fernandes
2             3    Mateus      Amoedo      Ana     Arantes
3             4       Ivo    Trindade   Marcos     Menezes
4             5    Gerson      Vargas    Maria     Martins

# Left Join

In [37]:
pd.merge(data1,data2,on='discipline_id',how='left')

  discipline_id    name_x last_name_x   name_y last_name_y
0             1  Bernardo    Anderson  Roberto     Sampaio
1             2      Alan    Teixeira  Mariana   Fernandes
2             3    Mateus      Amoedo      Ana     Arantes
3             4       Ivo    Trindade   Marcos     Menezes
4             5    Gerson      Vargas    Maria     Martins

# Right Join

In [38]:
pd.merge(data1,data2,on='discipline_id',how='right')

  discipline_id    name_x last_name_x   name_y last_name_y
0             1  Bernardo    Anderson  Roberto     Sampaio
1             2      Alan    Teixeira  Mariana   Fernandes
2             3    Mateus      Amoedo      Ana     Arantes
3             4       Ivo    Trindade   Marcos     Menezes
4             5    Gerson      Vargas    Maria     Martins

# Adding Suffixes

In [40]:
pd.merge(data1,data2,on='discipline_id',how='left', suffixes=('_left','_right'))

  discipline_id name_left last_name_left name_right last_name_right
0             1  Bernardo       Anderson    Roberto         Sampaio
1             2      Alan       Teixeira    Mariana       Fernandes
2             3    Mateus         Amoedo        Ana         Arantes
3             4       Ivo       Trindade     Marcos         Menezes
4             5    Gerson         Vargas      Maria         Martins

# Join based in indexes

In [41]:
pd.merge(data1,data2,right_index=True,left_index=True)

  discipline_id_x    name_x last_name_x discipline_id_y   name_y last_name_y
0               1  Bernardo    Anderson               1  Roberto     Sampaio
1               2      Alan    Teixeira               2  Mariana   Fernandes
2               3    Mateus      Amoedo               3      Ana     Arantes
3               4       Ivo    Trindade               4   Marcos     Menezes
4               5    Gerson      Vargas               5    Maria     Martins